app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@education.com'
---
    public function login()
    {
        $db = \Config\Database::connect();
        $session = session();

        // If user is already logged in, redirect to dashboard
        if ($session->get('userID')) {
            return redirect()->to('/dashboard');
        }

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required'
            ];

            if (!$this->validate($rules)) {
                return view('auth/login', ['validation' => $this->validator]);
            }

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            // Check if user exists
            $builder = $db->table('users');
            $user = $builder->where('email', $email)->get()->getRowArray();